#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devperimental/package-setup/runs/run-FSyhiyQBm9xUV23v

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
github_repository.standard-repo["frontend-portal-api"]: Refreshing state... [id=frontend-portal-api]
github_repository.standard-repo["frontend-client-api"]: Refreshing state... [id=frontend-client-api]
github_repository.standard-repo["frontend-management-api"]: Refreshing state... [id=frontend-management-api]
github_repository.template-repo["component-externalapis"]: Refreshing state... [id=component-externalapis]
github_repository.template-repo["component-queues"]: Refreshing state... [id=component-queues]
github_repository.template-repo["component-dataaccess"]: Refreshing state... [id=component-dataaccess]
github_repository.template-repo["component-email"]: Refreshing state... [id=component-email]
github_repository.template-repo["component-storage"]: Refreshing state... [id=component-storage]
github_repository.template-repo["component-api-extensions"]: Refreshing state... [id=component-api-extensions]
github_repository.template-repo["component-settings"]: Refreshing state... [id=component-settings]
github_repository.template-repo["component-payments"]: Refreshing state... [id=component-payments]
github_repository.template-repo["component-sms"]: Refreshing state... [id=component-sms]
github_repository.template-repo["component-servicehelper"]: Refreshing state... [id=component-servicehelper]
github_actions_secret.repo_secret["component-servicehelper"]: Refreshing state... [id=component-servicehelper:NUGET_PAT]
github_actions_secret.repo_secret["frontend-management-api"]: Refreshing state... [id=frontend-management-api:NUGET_PAT]
github_actions_secret.repo_secret["frontend-client-api"]: Refreshing state... [id=frontend-client-api:NUGET_PAT]
github_actions_secret.repo_secret["component-email"]: Refreshing state... [id=component-email:NUGET_PAT]
github_actions_secret.repo_secret["component-dataaccess"]: Refreshing state... [id=component-dataaccess:NUGET_PAT]
github_actions_secret.repo_secret["component-sms"]: Refreshing state... [id=component-sms:NUGET_PAT]
github_actions_secret.repo_secret["component-externalapis"]: Refreshing state... [id=component-externalapis:NUGET_PAT]
github_actions_secret.repo_secret["component-queues"]: Refreshing state... [id=component-queues:NUGET_PAT]
github_actions_secret.repo_secret["component-api-extensions"]: Refreshing state... [id=component-api-extensions:NUGET_PAT]
github_actions_secret.repo_secret["component-storage"]: Refreshing state... [id=component-storage:NUGET_PAT]
github_actions_secret.repo_secret["frontend-portal-api"]: Refreshing state... [id=frontend-portal-api:NUGET_PAT]
github_actions_secret.repo_secret["component-payments"]: Refreshing state... [id=component-payments:NUGET_PAT]
github_actions_secret.repo_secret["component-settings"]: Refreshing state... [id=component-settings:NUGET_PAT]
github_repository_collaborator.a_repo_collaborator["frontend-management-api"]: Refreshing state... [id=frontend-management-api:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-storage"]: Refreshing state... [id=component-storage:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-queues"]: Refreshing state... [id=component-queues:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-dataaccess"]: Refreshing state... [id=component-dataaccess:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-sms"]: Refreshing state... [id=component-sms:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-settings"]: Refreshing state... [id=component-settings:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-servicehelper"]: Refreshing state... [id=component-servicehelper:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-payments"]: Refreshing state... [id=component-payments:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-email"]: Refreshing state... [id=component-email:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-api-extensions"]: Refreshing state... [id=component-api-extensions:chrisxpr]
github_repository_collaborator.a_repo_collaborator["frontend-portal-api"]: Refreshing state... [id=frontend-portal-api:chrisxpr]
github_repository_collaborator.a_repo_collaborator["frontend-client-api"]: Refreshing state... [id=frontend-client-api:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-externalapis"]: Refreshing state... [id=component-externalapis:chrisxpr]
github_branch_protection.standard-repo-protection["frontend-portal-api"]: Refreshing state... [id=BPR_kwDOJFQCiM4CFV1c]
github_branch_protection.standard-repo-protection["frontend-client-api"]: Refreshing state... [id=BPR_kwDOJFQCec4CFV1X]
github_branch_protection.standard-repo-protection["frontend-management-api"]: Refreshing state... [id=BPR_kwDOJFQCm84CFV1Z]
github_branch_protection.repo-protection["component-servicehelper"]: Refreshing state... [id=BPR_kwDOJCfP0s4CFV1i]
github_branch_protection.repo-protection["component-dataaccess"]: Refreshing state... [id=BPR_kwDOJCfPns4CFV1m]
github_branch_protection.repo-protection["component-payments"]: Refreshing state... [id=BPR_kwDOJCfPqc4CFV1l]
github_branch_protection.repo-protection["component-externalapis"]: Refreshing state... [id=BPR_kwDOJCfPt84CFV1j]
github_branch_protection.repo-protection["component-settings"]: Refreshing state... [id=BPR_kwDOJCfPss4CFV1h]
github_branch_protection.repo-protection["component-api-extensions"]: Refreshing state... [id=BPR_kwDOJFQCsM4CFV1p]
github_branch_protection.repo-protection["component-email"]: Refreshing state... [id=BPR_kwDOJCfPzc4CFV1s]
github_branch_protection.repo-protection["component-queues"]: Refreshing state... [id=BPR_kwDOJFIBWc4CFV1k]
github_branch_protection.repo-protection["component-sms"]: Refreshing state... [id=BPR_kwDOJCfPls4CFV1t]
github_branch_protection.repo-protection["component-storage"]: Refreshing state... [id=BPR_kwDOJFIBVs4CFV1g]
github_branch_protection.repo-protection["component-api-extensions"]: Drift detected (update)
github_branch_protection.standard-repo-protection["frontend-management-api"]: Drift detected (update)
github_repository.standard-repo["frontend-management-api"]: Drift detected (update)
github_repository.standard-repo["frontend-portal-api"]: Drift detected (update)
github_repository.standard-repo["frontend-client-api"]: Drift detected (update)
github_repository.template-repo["component-sms"]: Drift detected (update)
github_repository.template-repo["component-email"]: Drift detected (update)
github_repository.template-repo["component-storage"]: Drift detected (update)
github_repository.template-repo["component-externalapis"]: Drift detected (update)
github_repository.template-repo["component-queues"]: Drift detected (update)
github_repository.template-repo["component-payments"]: Drift detected (update)
github_repository.template-repo["component-settings"]: Drift detected (update)
github_repository.template-repo["component-servicehelper"]: Drift detected (update)
github_repository.template-repo["component-api-extensions"]: Drift detected (update)
github_repository.template-repo["component-dataaccess"]: Drift detected (update)
github_actions_secret.repo_secret["component-externalapis"]: Drift detected (delete)
github_actions_secret.repo_secret["component-api-extensions"]: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.repo_secret["component-api-extensions"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-api-extensions"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-externalapis"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-externalapis"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["signup-validator-api"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "signup-validator-api"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.repo-protection["component-api-extensions"] will be updated in-place
  ~ resource "github_branch_protection" "repo-protection" {
      ~ enforce_admins                  = false -> true
        id                              = "BPR_kwDOJFQCsM4CFV1p"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repo-protection["signup-validator-api"] will be created
  + resource "github_branch_protection" "repo-protection" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.standard-repo-protection["frontend-management-api"] will be updated in-place
  ~ resource "github_branch_protection" "standard-repo-protection" {
      ~ enforce_admins                  = false -> true
        id                              = "BPR_kwDOJFQCm84CFV1Z"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.standard-repo["frontend-management-api"] will be updated in-place
  ~ resource "github_repository" "standard-repo" {
        id                          = "frontend-management-api"
      - is_template                 = true -> null
        name                        = "frontend-management-api"
        # (30 unchanged attributes hidden)
    }

  # github_repository.template-repo["signup-validator-api"] will be created
  + resource "github_repository" "template-repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + branches                    = (known after apply)
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Signup Validator API Repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "signup-validator-api"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + owner      = "devperimental"
          + repository = "frontend-management-api"
        }
    }

  # github_repository_collaborator.a_repo_collaborator["signup-validator-api"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "signup-validator-api"
      + username                    = "chrisxpr"
    }

Plan: 6 to add, 3 to change, 0 to destroy.

```

</details>

*Pushed by: @devperimental, Action: `pull_request`*